[
  {
    "id": 360,
    "title": "Краткое описание Ktor и его преимуществ.",
    "url": "/tutorials/kotlin/ktor/intro",
    "chapter": 1,
    "keywords": "еблокирующий ввод-вывод,  тестирование, асинхронное программирование,  Native,  шифрование, Краткое описание Ktor и его преимуществ., metanit,  REST API, статьи, HTTP,  многопоточность,  отладка,  Android, Kotlin, обучение,  сообщество, фреймворк, habr,  CORS,  iOS,  HTTP/2,  JVM,  документация,  клиентская часть,  JavaScript, корутины, Ktor, клиент, легкость в использовании, обучающие статьи по программированию, хабр, progvibe.ru,  Kotlin Multiplatform. \n, прогвайб,  сокеты,  серверная часть,  многоплатформенность,  мобильные приложения,  сертификаты, метанит,  платформа, как научиться программировать, progvibe, высокая производительность, сервер, программирование,  веб-приложения,  безопасность,  cross-platform,  WebSocket",
    "description": "",
    "name": "intro"
  },
  {
    "id": 361,
    "title": "Расширенные методы маршрутизации: параметры пути, заголовки, регулярные выражения.",
    "url": "/tutorials/kotlin/ktor/routing",
    "chapter": 2,
    "keywords": "астройка,  фреймворки, metanit, Маршрутизация,  REST API, статьи,  заголовки,  HTTP-запросы,  PATCH, обучение, habr,  POST,  динамические маршруты,  валидация,  расширенные методы,  документация. \n,  DELETE, Расширенные методы маршрутизации: параметры пути, заголовки, регулярные выражения., параметры пути, обучающие статьи по программированию,  веб-разработка, хабр, progvibe.ru, прогвайб,  серверная часть,  защита,  соответствие, метанит,  GET,  группировка, как научиться программировать, progvibe,  регулярные выражения,  фильтрация,  переменные,  URL-параметры,  методы HTTP,  замены,  конфигурация,  PUT, программирование,  безопасность,  сопоставление шаблонов",
    "description": "",
    "name": "routing"
  },
  {
    "id": 362,
    "title": "Создание пользовательских маршрутизаторов и обработчиков.",
    "url": "/tutorials/kotlin/ktor/custom_routing",
    "chapter": 2,
    "keywords": "раметры, API, metanit, Создание пользовательских маршрутизаторов и обработчиков., фреймворки, шаблоны проектирования, советы, best practices, маршрутизация, статьи, MVC, REST API, контроллеры, документация, ответы, аутентификация, обучение, тестирование, AJAX, habr, пользовательские маршрутизаторы, HTTP-методы, примеры кода, обучающие статьи по программированию, веб-разработка, хабр, progvibe.ru, прогвайб, серверная часть, безопасность, примеры, middleware, производительность, фронтенд, оптимизация, маршруты, авторизация, метанит, бэкенд, API-интерфейсы, клиентская часть, как научиться программировать, progvibe, запросы, обработчики, обработка, рекомендации. \n, программирование, URL-маршрутизация, навигация, базы данных, URL",
    "description": "",
    "name": "custom_routing"
  },
  {
    "id": 363,
    "title": "Асинхронная обработка запросов с использованием корутин.",
    "url": "/tutorials/kotlin/ktor/coroutines",
    "chapter": 2,
    "keywords": "U-bound, asyncio, thread, многопроцессорность. \n, metanit, серверы, веб-приложения, статьи, сетевое программирование, process, Python, future, блокирующий код, обучение, event loop, habr, task, I/O-bound, клиентские приложения, Асинхронная обработка, корутины, concurrency, масштабируемость, обучающие статьи по программированию, эффективность, хабр, progvibe.ru, отзывчивость, прогвайб, ресурсоемкие операции, производительность, сетевой ввод-вывод, оптимизация, неблокирующий код, callback, yield, метанит, микросервисы, как научиться программировать, progvibe, параллелизм, Асинхронная обработка запросов с использованием корутин., программирование, await, многопоточность",
    "description": "",
    "name": "coroutines"
  },
  {
    "id": 364,
    "title": "Сериализация и десериализация данных с помощью Jackson, Gson и kotlinx.serialization.",
    "url": "/tutorials/kotlin/ktor/serializations",
    "chapter": 3,
    "keywords": "мен данными, API, REST, веб-сервис, metanit,  кодирование, Java, рекомендации,  декодирование,  конвертация, best practices, HTTP, преобразование, Jackson,  сравнительный анализ, статьи, kotlinx.serialization, Kotlin, объект, обучение, тестирование, сравнение, habr, API-интерфейс, строка, примеры кода, обучающие статьи по программированию, Сериализация, эффективность,  benchmark, хабр, progvibe.ru, прогвайб, Сериализация и десериализация данных с помощью Jackson, Gson и kotlinx.serialization., формат данных, производительность, оптимизация,  инструменты разработки. \n, парсер,  JSON-схема, метанит, микросервисы, JSON, как научиться программировать, десериализация, progvibe, выбор библиотеки, Gson, программирование, библиотека",
    "description": "",
    "name": "serializations"
  },
  {
    "id": 365,
    "title": "Валидация данных с использованием встроенных и пользовательских валидаторов.",
    "url": "/tutorials/kotlin/ktor/validation",
    "chapter": 3,
    "keywords": "лидация данных, схемы валидации, metanit, проверка на пустоту, длина данных,  валидация API, валидация форм, статьи, типы данных, регулярные выражения, обучение,  тестирование валидаторов,  отладка ошибок, habr,  эффективность валидации, сообщения об ошибках,  документация,  создание валидаторов,  примеры кода. \n, проверка на уникальность, пользовательские валидаторы, ошибки валидации, валидация на стороне клиента, обучающие статьи по программированию, хабр, progvibe.ru, прогвайб, валидация на стороне сервера,  безопасность данных, встроенные валидаторы,  принудительное заполнение, формат данных, ограничения данных, обработка ошибок, использование валидаторов, метанит, проверка данных, Валидация данных с использованием встроенных и пользовательских валидаторов., как научиться программировать, progvibe, контроль качества данных, правила валидации, валидация входных данных,  проверка на дубликаты, программирование, валидация выходных данных",
    "description": "",
    "name": "validation"
  },
  {
    "id": 366,
    "title": "Подключение к базам данных с использованием Exposed или других ORM.",
    "url": "/tutorials/kotlin/ktor/databases",
    "chapter": 3,
    "keywords": "дключение к базе данных, metanit, Hibernate, MyBatis, MySQL, статьи, SQLite, Обработка результатов, CRUD операции, Exposed, Kotlin, обучение, JPA, Security, Транзакции, Django ORM, Performance, JDBC, Настройка, habr, Модели данных, Developer productivity, Dapper, SQLAlchemy, Maintainability. \n, Подключение к базам данных с использованием Exposed или других ORM., Сравнение ORM, обучающие статьи по программированию, хабр, progvibe.ru, прогвайб, Создание запросов, Best practices, SQL, Схема базы данных, ORM, Конфигурация, ORM vs JDBC, метанит, Недостатки Exposed, Room, Базы данных, Spring Data JPA, как научиться программировать, progvibe, Сопоставление объектов и реляционных данных, Асинхронное взаимодействие, Преимущества Exposed, Выполнение запросов, Code readability, программирование, PostgreSQL, Entity Framework",
    "description": "",
    "name": "databases"
  },
  {
    "id": 367,
    "title": "Аутентификация с использованием Basic, OAuth, JWT и других механизмов.",
    "url": "/tutorials/kotlin/ktor/authentication",
    "chapter": 4,
    "keywords": "sic аутентификация, мобильные приложения,  двухфакторная аутентификация, API, шифрование, metanit, веб-приложения, payload, токен, HTTP, статьи,  scope,  header, REST API,  технология аутентификации, обучение, JWT, habr,  управление идентификацией, секрет,  безопасность учетной записи, signature,  grant type, клиент, Аутентификация с использованием Basic, OAuth, JWT и других механизмов., обучающие статьи по программированию, идентификатор, HTTPS, Аутентификация, ключ, refresh token, хабр, пользователь,  безопасность данных, безопасность,  JSON Web Token,  управление доступом, progvibe.ru, прогвайб, пароль, авторизация, метанит,  протокол аутентификации,  метод аутентификации. \n, как научиться программировать, progvibe, OAuth, сервер, программирование,  безопасность",
    "description": "",
    "name": "authentication"
  },
  {
    "id": 368,
    "title": "Авторизация с использованием ролей, прав доступа и политик.",
    "url": "/tutorials/kotlin/ktor/authorization",
    "chapter": 4,
    "keywords": "ступ к данным, Наследование, Мониторинг, Авторизация, metanit, Пользователи, Системные ресурсы, IAM, Политика паролей, статьи, Политики безопасности, Идентификация, Права доступа, Настройки безопасности, обучение, Контроль, habr, RBAC, Политики, Профили доступа, Управление пользователями, Безопасная среда, обучающие статьи по программированию, Аутентификация, хабр, Безопасность, progvibe.ru, прогвайб, Авторизация с использованием ролей, прав доступа и политик., Доступ, Отчетность \n, Управление доступом, ACL, ABAC, Группы, Безопасный доступ, метанит, как научиться программировать, Безопасность приложений, progvibe, Делегирование, Аудит, программирование, Роли, Ограничение доступа, Ролевые модели, Логирование, Иерархия",
    "description": "",
    "name": "authorization"
  },
  {
    "id": 369,
    "title": "Написание модульных тестов для маршрутов, обработчиков и сервисов.",
    "url": "/tutorials/kotlin/ktor/unit_tests",
    "chapter": 5,
    "keywords": "стирование авторизации, Stubbing, Unit testing, Coverage, metanit, Express.js, Тестирование асинхронного кода, Debugging, Integration testing, Тестирование контроллеров, статьи, Jest, сервисы, Sinon.js, Рефакторинг, Node.js, обучение, habr, Тестовые данные, Тестовые сценарии, Тестирование middleware, Тестирование зависимостей, Mocha, End-to-end testing \n, Написание модульных тестов для маршрутов, обработчиков и сервисов., Mocking, Тестирование юнит-тестов, Тестирование ошибок, обучающие статьи по программированию, Code coverage, Тестирование моделей, хабр, progvibe.ru, прогвайб, Best practices, маршруты, метанит, Модульное тестирование, как научиться программировать, progvibe, Chai, Supertest, Тестирование баз данных, обработчики, Тестирование аутентификации, Тестовая среда, Тестирование интеграции, программирование, CI/CD, Тестирование API, Написание тестов",
    "description": "",
    "name": "unit_tests"
  },
  {
    "id": 370,
    "title": "Использование TestApplicationEngine для интеграционного тестирования.",
    "url": "/tutorials/kotlin/ktor/tesapplicationengine",
    "chapter": 5,
    "keywords": "томатизация тестирования, надежность, API тестирование,  отчеты,  JUnit, Cucumber, metanit,  REST API,  улучшение. \n,  контейнеризация, статьи, отказоустойчивость, нагрузочное тестирование, Kubernetes, тестовая среда, Docker, функциональное тестирование, тестовые данные, обучение, TestApplicationEngine, habr, mock-объекты, NUnit, pytest, тестовые сценарии, DevOps,  ORM,  результаты, тест-кейсы,  метрики, Selenium, интеграционное тестирование, обучающие статьи по программированию, устойчивость,  прогресс, хабр, конфигурация, управление зависимостями, progvibe.ru, SOAP API, безопасность, прогвайб,  аналитика, производительность, end-to-end тестирование, фреймворки тестирования, TestNG, метанит, как научиться программировать, progvibe, stub-объекты,  базы данных, программирование, CI/CD,  инфраструктура, Использование TestApplicationEngine для интеграционного тестирования., модульное тестирование",
    "description": "",
    "name": "tesapplicationengine"
  },
  {
    "id": 371,
    "title": "Написание end-to-end тестов с использованием фреймворков, таких как Selenium.",
    "url": "/tutorials/kotlin/ktor/endtoendtests",
    "chapter": 5,
    "keywords": "томатизация тестирования, тестовый код, отчетность, локальное тестирование, UI тестирование, Cucumber, metanit, Java, best practices, статьи, web-приложения, WebDriver, Python, функциональное тестирование, Continuous Testing \n, документация, тестовые данные, обучение, язык программирования, тестирование безопасности, фреймворк, JavaScript, habr, Написание end-to-end тестов с использованием фреймворков, таких как Selenium., тестовый сценарий, DevOps, Page Object Model, Agile, Git, управление рисками, Selenium, интеграционное тестирование, обучающие статьи по программированию, хабр, progvibe.ru, JUnit, прогвайб, фреймворки автоматизации тестирования, оптимизация, end-to-end тестирование, браузерное тестирование, TestNG, метанит, как научиться программировать, progvibe, анализ результатов, программирование, тестирование производительности, CI/CD, Jenkins, облачное тестирование",
    "description": "",
    "name": "endtoendtests"
  },
  {
    "id": 372,
    "title": "Настройка пула потоков и таймаутов.",
    "url": "/tutorials/kotlin/ktor/streams",
    "chapter": 6,
    "keywords": "readPoolExecutor, мониторинг, асинхронное, планировщик, metanit, Java, пул, ThreadPoolTaskExecutor, ScheduledExecutorService, статьи, параллельное, ExecutorService, Python, потоков, обучение, async, Spring, keepAliveTime, habr, Настройка, выполнение, потоки, управление, Настройка пула потоков и таймаутов., await \n, corePoolSize, .NET, maximumPoolSize, таймаут, ресурсы,  asyncio, блокировка, метрики, обучающие статьи по программированию, хабр, progvibe.ru, прогвайб, производительность, queueSize, оптимизация, масштабирование, ожидание, обработка ошибок, метанит, исключения, как научиться программировать, progvibe, балансировка нагрузки, обработка, задач, программирование, многопоточность",
    "description": "",
    "name": "streams"
  },
  {
    "id": 373,
    "title": "Кэширование данных и ответов.",
    "url": "/tutorials/kotlin/ktor/caches",
    "chapter": 6,
    "keywords": "тимизация производительности, быстродействие, кэширование с истечением срока действия, metanit, статьи, кэширование ответов, кэш, кэширование с использованием памяти, кэширование с использованием распределенных систем, обучение, нагрузка, кэширование, habr, стратегия, часто используемые данные, запрос, алгоритм, очистка кэша, Кэширование данных, снижение нагрузки, кэширование на стороне сервера, клиент, кэширование с использованием баз данных, управление кэшем, снижение нагрузки на сервер, время отклика, кэширование с использованием файлов, обучающие статьи по программированию, хабр, progvibe.ru, прогвайб, истечение срока действия, производительность, ответ, база данных, оптимизация, повторный запрос, кэширование с прокси-сервером, метанит, как научиться программировать, progvibe, Кэширование данных и ответов., сервер, программирование, кэширование на стороне клиента, хранилище, улучшение пользовательского опыта. \n",
    "description": "",
    "name": "caches"
  },
  {
    "id": 374,
    "title": "Использование WebSocket для создания приложений реального времени.",
    "url": "/tutorials/kotlin/ktor/websocket",
    "chapter": 6,
    "keywords": "I, metanit, веб-приложения, фреймворки, клиент-сервер, HTTP, статьи, Python, приложения, TCP, Node.js, обучение, Vue.js, протокол, Angular, JavaScript, habr, сокеты, данные, WebSocket, браузер, React, XML, обучающие статьи по программированию, игры, веб-разработка, хабр, progvibe.ru, прогвайб, безопасность, метанит, чат, библиотеки, уведомления, как научиться программировать, JSON, потоковая передача, progvibe, сервер, программирование, PHP, разработка, Использование WebSocket для создания приложений реального времени., реальное время, двусторонняя связь, масштабирование. \n",
    "description": "",
    "name": "websocket"
  },
  {
    "id": 375,
    "title": "Разpаботка микросервисов и развертывание в Docker.",
    "url": "/tutorials/kotlin/ktor/docker",
    "chapter": 6,
    "keywords": "естирование,  модульность, API, REST, metanit,  образы Docker,  декомпозиция,  виртуальные машины, статьи, Разpаботка микросервисов и развертывание в Docker., развертывание, Kubernetes,  мониторинг,  облачные платформы, Docker,  операции,  разработка, обучение,  автоматизация, gRPC,  масштабирование,  отказоустойчивость,  бессерверные вычисления. \n, habr, оркестрация,  Dockerfile, обучающие статьи по программированию, контейнеризация,  деплоймент, хабр, progvibe.ru, прогвайб,  контейнерные реестры, метанит, микросервисы, как научиться программировать, progvibe,  независимость, программирование, архитектура, CI/CD,  DevOps,  конфигурация,  безопасность,  сетевые модели",
    "description": "",
    "name": "docker"
  },
  {
    "id": 376,
    "title": "Создание пользовательских плагинов и функций.",
    "url": "/tutorials/kotlin/ktor/customization",
    "chapter": 7,
    "keywords": "астройка, customization,  модульность, API,  тестирование \n, функции, metanit,  скрипты, статьи, пользовательские,  отладка, обучение,  код,  расширенные возможности,  автоматизация,  управление функциями,  интеграция, habr,  удобство использования,  документация,  разработка плагинов, обучающие статьи по программированию,  повышение производительности, хабр, progvibe.ru, прогвайб,  интерфейс,  разработка функций,  пользовательский опыт, функциональность,  улучшение, метанит,  управление плагинами, программное обеспечение, как научиться программировать, progvibe,  адаптация, плагины, программирование, разработка,  языки программирования, расширения,  эффективность, Создание пользовательских плагинов и функций.",
    "description": "",
    "name": "customization"
  },
  {
    "id": 377,
    "title": "Интеграция с другими библиотеками и фреймворками.",
    "url": "/tutorials/kotlin/ktor/integration",
    "chapter": 7,
    "keywords": "одинг, API,  компоненты. \n, metanit,  модель, фреймворки,  архитектура,  программирование, статьи, Интеграция с другими библиотеками и фреймворками., подключение, Интеграция,  сервисы,  разработка, обучение,  решение, язык программирования,  ресурсы,  инструмент, habr, кроссплатформенность,  утилита, расширенная функциональность, модули, языки программирования,  приложения, обучающие статьи по программированию, хабр, progvibe.ru, прогвайб,  интерфейс,  система, пакеты,  протокол, метанит, библиотеки, расширение функциональности,  платформа, программное обеспечение, как научиться программировать, progvibe, программирование, зависимости, совместимость, взаимодействие",
    "description": "",
    "name": "integration"
  },
  {
    "id": 378,
    "title": "Мониторинг и логирование.",
    "url": "/tutorials/kotlin/ktor/logging",
    "chapter": 7,
    "keywords": "ализ, мониторинг, показатели, пользователи, metanit, отчеты, предупреждения, инструменты, best practices, статьи, интеграция, сервисы, доступность, security audit \n, приложения, события, обучение, SOX, сетевая активность, инфраструктура, habr, политика, данные, обучающие статьи по программированию, визуализация, метрики, платформы, хабр, конфигурация, базы данных, progvibe.ru, трассировка, безопасность, прогвайб, производительность, система, метанит, Мониторинг и логирование., ошибки, dashboard, как научиться программировать, progvibe, логирование, compliance, GDPR, оповещения, программирование, журналы, хранилище",
    "description": "",
    "name": "logging"
  }
]