## IP-адресация и подсети

В основе функционирования компьютерных сетей лежит способность устройств однозначно идентифицировать друг друга и обмениваться данными. Для этого каждому устройству в сети присваивается уникальный идентификатор – IP-адрес.  

### Что такое IP-адрес?

IP-адрес (Internet Protocol address) – это числовой идентификатор, назначаемый каждому устройству (компьютеру, смартфону, серверу), подключенному к сети, работающей по протоколу IP.  

Существуют две версии IP-адресов: IPv4 и IPv6.

* **IPv4** –  представляет собой 32-битное число, записываемое в десятичной форме с разделением точками. Например: 192.168.1.100.
* **IPv6** –  использует 128 бит и записывается в шестнадцатеричной форме с разделением двоеточиями. Например: 2001:0db8:85a3:0000:0000:8a2e:0370:7334.

В рамках данного раздела мы сосредоточимся на IPv4, так как он все еще наиболее распространен. 

### Структура IP-адреса

IP-адрес состоит из двух частей:

1. **Идентификатор сети (Network ID)** – определяет сеть, к которой принадлежит устройство.
2. **Идентификатор узла (Host ID)** –  идентифицирует конкретное устройство в сети. 

Например, в адресе 192.168.1.100:

* 192.168.1 – идентификатор сети.
* 100 – идентификатор узла.

### Маска подсети

Для определения, какая часть IP-адреса относится к идентификатору сети, а какая к идентификатору узла, используется **маска подсети (subnet mask)**. Маска подсети имеет ту же структуру, что и IP-адрес, но в ней единицы в двоичном представлении обозначают биты идентификатора сети, а нули – биты идентификатора узла.

Например:

* IP-адрес: 192.168.1.100
* Маска подсети: 255.255.255.0

В двоичной форме:

* IP-адрес: `11000000.10101000.00000001.01100100`
* Маска подсети: `11111111.11111111.11111111.00000000`

### Классы IP-адресов

Исторически сложилось деление IP-адресов на классы:

| Класс | Начальный адрес | Конечный адрес | Маска по умолчанию |
|---|---|---|---|
| A | 0.0.0.0 | 127.255.255.255 | 255.0.0.0 |
| B | 128.0.0.0 | 191.255.255.255 | 255.255.0.0 |
| C | 192.0.0.0 | 223.255.255.255 | 255.255.255.0 |
| D | 224.0.0.0 | 239.255.255.255 | Зарезервировано для multicast |
| E | 240.0.0.0 | 255.255.255.255 | Зарезервировано для экспериментальных целей |

### Подсети

Для более эффективного использования адресного пространства сети класса A, B и C можно делить на более мелкие сети – подсети. 

Создание подсетей происходит путем "заимствования" битов у идентификатора узла и добавления их к идентификатору сети. 

**Пример:**

Предположим, у нас есть сеть с адресом 192.168.1.0 и маской 255.255.255.0. Мы хотим разделить ее на 4 подсети. 

1. Определите, сколько битов нужно занять: 2^2 = 4, значит, нам нужно 2 бита.
2. Занимаем 2 бита из идентификатора узла: новая маска подсети 255.255.255.192 (11111111.11111111.11111111.11000000)
3. Получаем 4 подсети:
    * 192.168.1.0 - 192.168.1.63
    * 192.168.1.64 - 192.168.1.127
    * 192.168.1.128 - 192.168.1.191
    * 192.168.1.192 - 192.168.1.255

### Проверка IP-адреса и маски подсети

```python
import ipaddress

def validate_ip(ip_address):
  """
  Функция проверяет, является ли переданная строка валидным IPv4-адресом.

  Args:
    ip_address: Строка, содержащая IP-адрес.

  Returns:
    True, если адрес валидный, False в противном случае.
  """
  try:
    ipaddress.ip_address(ip_address)
    return True
  except ValueError:
    return False

# Пример использования
ip_address = "192.168.1.100"
if validate_ip(ip_address):
  print(f"{ip_address} - валидный IPv4-адрес")
else:
  print(f"{ip_address} - неверный IPv4-адрес")
```

Этот код демонстрирует простой пример проверки валидности IP-адреса с использованием библиотеки `ipaddress`.  

В следующих разделах мы подробнее рассмотрим IPv6, DHCP, NAT и другие важные аспекты работы с IP-адресами и подсетями. 
